# Ultralytics YOLOv8n-CBAM Custom Model (Fixed for Nano Scale)
# Parameters
nc: 80  # number of classes
scales: 
  n: [0.33, 0.25, 1024] 

# YOLOv8.0n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  # FIX: 128 * 0.25 = 32 channels
  - [-1, 1, CBAM, [32]]        # 3 <--- FIX CHANNEL SIZE
  
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]]  # 5
  # FIX: 256 * 0.25 = 64 channels
  - [-1, 1, CBAM, [64]]        # 6 <--- FIX CHANNEL SIZE
  
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]]  # 8
  # FIX: 512 * 0.25 = 128 channels
  - [-1, 1, CBAM, [128]]       # 9 <--- FIX CHANNEL SIZE
  
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]  # 11
  # FIX: 1024 * 0.25 = 256 channels
  - [-1, 1, CBAM, [256]]        # 12 <--- FIX CHANNEL SIZE
  - [-1, 1, SPPF, [1024, 5]]    # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]] # Concat dengan CBAM layer 9
  - [-1, 3, C2f, [512]]       # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # Concat dengan CBAM layer 6
  - [-1, 3, C2f, [256]]       # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] 
  - [-1, 3, C2f, [512]]        # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] 
  - [-1, 3, C2f, [1024]]       # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]] # Detect layer